{"inkVersion":16,"root":["\n","\n","ev",{"x()":"GET_DAY_ONE_DREAM"},"/ev",{"temp=":"dream"},"ev",{"x()":"GET_DAY_ONE_SAW_EMAIL_BEFORE_LOG"},"/ev",{"temp=":"saw_email"},["G>",["ev",{"VAR?":"dream"},1,"==","/ev",{"->":".^.b","c":true},{"b":[{"->":"SUSPICIOUS_DREAM"},{"->":"10.4"},null]}],["ev",{"VAR?":"dream"},2,"==","/ev",{"->":".^.b","c":true},{"b":[{"->":"TRUSTFULL_DREAM"},{"->":"10.4"},null]}],["ev",{"VAR?":"dream"},3,"==","/ev",{"->":".^.b","c":true},{"b":[{"->":"BORED_DREAM"},{"->":"10.4"},null]}],"nop","G<",null],"\n","done",{"SUSPICIOUS_DREAM":[["G>","ev",{"f()":"log_status"},"out","/ev","G<",null],"\n","^I think I'm getting too paranoic. Today I dreamed that my mother tried to kill me! Can't I even trust my dead mother? I shouldn't drink coffe before going to sleep, the cafeine might be enhancing my trust issues.","\n",["G>","ev",{"f()":"email_content_comment"},"out","/ev","G<",null],"^ I'll take a look at it, but after this dream, I'd better not trust her too much, even though I have no choice considering what she knows.","\n","end",{"#f":3}],"TRUSTFULL_DREAM":[["G>","ev",{"f()":"log_status"},"out","/ev","G<",null],"\n","^Well, that was fun. I haven't had a nice dream in such a long time. Greate way to start a day. Till I look outside and see that it's raining. I don't even know I it bothers me so much. I can't go out anyway.","\n","^Let's just hope the day will be as fun as my dream.","\n","^Wow, I just read this and I sounded like a happy person. Very unlike me, no paranoia, no depression. I think this might have been the best log I wrote in a long time. Better not get used to it.","\n","^Anyways","\n",["G>","ev",{"f()":"email_content_comment"},"out","/ev","G<",null],"\n","end",{"#f":3}],"BORED_DREAM":[["G>","ev",{"f()":"log_status"},"out","/ev","G<",null],"\n","^Today I'll probably kill myself - just kidding [or am I?].","\n","^I can't take more of this, now even my fucking dreams are boring. Comon brain, the only reason I go to sleep is so that I can catch a break of this and you don't even come up with something nice? Or not nice? Just the same boring things over and over. What if I start taking drugs? Well, considering my \"special condition\", I better not.","\n","^Anyways","\n",["G>","ev",{"f()":"email_content_comment"},"out","/ev","G<",null],"\n","end",{"#f":3}],"log_status":["^Tue, Nov 31. Raining. 68 KG. 12/7. Meds taken.","\n",{"#f":3}],"email_content_comment":[["G>",["ev",{"VAR?":"saw_email"},1,"==","/ev",{"->":".^.b","c":true},{"b":["^Jo sent me an email this morning. Something about a transcript related to the profecy. Even though there's no such thing as profecies, it got me interested. The file is quite old, from way before. It should be fun to investigate a little bit.","\n",{"->":".^.^.^.3"},null]}],[{"->":".^.b"},{"b":["^Jo sent me an email this morning. I didn't see it yet. But the subject says it's profecy-related so it's probably some bullshit. But, coming from Jo, it should be at least interesting.","\n",{"->":".^.^.^.3"},null]}],"nop","G<",null],"\n",{"#f":3}],"global decl":["ev","/ev","end",null],"#f":3}],"listDefs":{}}